#Задача: Создать две переменные first=10, second=30. Вывести на экран построчно результат математического взаимодействия (+, -, *, /, **) для этих чисел.
#Разобраться как работают операторы % и //. Вывести на экран эти операции для переменных из пункта 2.

first = 10
second = 30

print (first + second)
print (first * second)
print (first - second)
print (first / second)
print (first ** second)

print (first // second)
print (first % second)

